//============================================================================================
// Application : TD4 Emulator & Assembler for X68000 - TD4.x
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ
//--------------------------------------------------------------------------------------------
// Filename    : inifile.c
// Version     : 1.0.0
// Author      : SEN::DAC
// Description : .ini ファイルのロード
//============================================================================================
//============================================================================================
// インクルードファイル
//============================================================================================
#include "inifile.h"

//============================================================================================
// 定数定義 (内部用)
//============================================================================================
// .ini ファイル キーワード有効文字範囲
// キーワードには 'a'～'z' と 'A'～'Z' および '_' が使用可能とする
#define INIF_KEY_C_MIN_0 0x41 // 'A'：キー認識文字コード最小値
#define INIF_KEY_C_MAX_0 0x5A // 'Z'：キー認識文字コード最大値
#define INIF_KEY_C_MIN_1 0x5F // '_'：キー認識文字コード最小値
#define INIF_KEY_C_MAX_1 0x5F // '_'：キー認識文字コード最大値
#define INIF_KEY_C_MIN_2 0x61 // 'a'：キー認識文字コード最小値
#define INIF_KEY_C_MAX_2 0x7A // 'z'：キー認識文字コード最大値

// 取得した文字コードが有効なキーワード文字かを判定する (TRUE : 有効 / FALSE : 無効)
#define IS_KEY_CHAR(c) \
    (((c) >= INIF_KEY_C_MIN_0 && (c) <= INIF_KEY_C_MAX_0) || \
     ((c) >= INIF_KEY_C_MIN_1 && (c) <= INIF_KEY_C_MAX_1) || \
     ((c) >= INIF_KEY_C_MIN_2 && (c) <= INIF_KEY_C_MAX_2))

// .iniファイル読み取り時のキーワード文字格納バッファ容量
#define KEY_BUF_SIZE     32

//============================================================================================
// 型定義 (内部用)
//============================================================================================

//============================================================================================
// プロトタイプ宣言 (static)
//============================================================================================

//============================================================================================
// グローバル変数定義 (外部公開)
//============================================================================================

//============================================================================================
// 静的変数定義 (static)
//============================================================================================

//============================================================================================
// 関数定義
//============================================================================================
//============================================================================================
// .ini ファイルロード
//--------------------------------------------------------------------------------------------
// Arguments : const char* const szcpc_filename : (I)   ロードするパス/ファイル名
//             stINI_PRM*  const stpc_tbl       : (I/O) キーワードと設定先変数の構造体テーブル
//             U4                u4_size        : (I)   stpc_tblの要素数
// Return    : BL                bl_ret         : (O)   TRUE  : 成功 (値の取得は保証しない)
//                                                      FALSE : 失敗
//--------------------------------------------------------------------------------------------
// Note      :
// .iniファイルが所定のフォーマットに則して記述されている事を前提としている。
// これにより、正しく値が設定できるかは当処理では保証されない。
//============================================================================================
BL blf_g_IniFileLoad(const char* const szcpc_filename, stINI_PRM* const stpc_tbl, U4 u4_size)
{
    S4   s4_i;
    BL   bl_ret   = FALSE;              // 戻り値格納用
    U1   u1_index = 0;                  // バッフアアクセス用インデックス
    U1   u1_val   = 0;                  // 数値読み取り用
    BL   bl_com   = FALSE;              // コメント中フラグ
    char sz_c     = '\0';               // 1文字格納用
    char sza_buf[KEY_BUF_SIZE] = { 0 }; // キーワード文字格納用バッファ

    FILE* fp = fopen(szcpc_filename, "rt");

    if(fp != NULL) // ファイルオープンに成功した場合
    {
        // ファイル終端まで行ったらループを抜ける
        while(fread(&sz_c, sizeof(char), 1, fp) == 1)
        {
            // '#'の場合 : 以降をコメントとして改行が来るまで読み捨てる
            if(sz_c == '#')
            {
                while(fread(&sz_c, sizeof(char), 1, fp) == 1)
                {
                    if(sz_c == '\n'){ u1_index = 0; break; }
                }
            }

            // キーワード有効文字の場合 : バッファ容量('\0'付与のため-1)が足りているなら格納
            else if (IS_KEY_CHAR(sz_c))
            {
                if(u1_index < (KEY_BUF_SIZE - 1)) sza_buf[u1_index ++] = sz_c;
            }

            // 半角スペース(区切り) かつ キーワード文字が1つ以上格納されている場合
            else if((sz_c == ' ') && (u1_index > 0))
            {
                sza_buf[u1_index] = '\0'; // 終端文字を付与

                // 全てのキーワードテーブルを巡回
                for(s4_i = 0; s4_i < u4_size; s4_i ++)
                {
                    // キーワードが一致した場合
                    if(strcmp(stpc_tbl[s4_i].szcpc_key, sza_buf) == 0)
                    {
                        u1_val = 0;     // 数値読み取り用変数を初期化
                        bl_com = FALSE; // コメント中フラグを初期化

                        // ファイル終端まで行ったらループを抜ける
                        while(fread(&sz_c, sizeof(char), 1, fp) == 1)
                        {
                            // 数字の場合は値を取得する
                            if((sz_c >= '0') && (sz_c <= '9') && !bl_com)
                            {
                                u1_val = u1_val * 10 + (sz_c - '0');
                            }

                            // '#'を見つけた場合は以降をコメントとして扱う
                            if(sz_c == '#'){ bl_com = TRUE; }
                            else if(sz_c == '\n') break; // 改行が来たら抜ける
                        }
                        *(stpc_tbl[s4_i].u1pc_val) = u1_val;
                    }
                }
                u1_index = 0; // バッファをリセット
            }
            else // 全ての条件に合致しない場合
            {
                u1_index = 0; // バッファをリセット
            }
        }

        fclose(fp);
        bl_ret = TRUE; // ロード成功 (値の取得は保証しない)
    }

    return bl_ret;
}
