//============================================================================================
// Application : TD4 Emulator & Assembler for X68000 - TD4.x
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ
//--------------------------------------------------------------------------------------------
// Filename    : cpu.c
// Version     : 1.0.0
// Author      : SEN::DAC
// Description : ターゲットCPUの定義と処理
//============================================================================================
//============================================================================================
// インクルードファイル
//============================================================================================
#include "cpu.h"

//============================================================================================
// 定数定義 (内部用)
//============================================================================================
// レジスタ設定 : パワーオンリセット値 (COLD RESET)
#define REG_A__C_RST 0       // Aレジスタ
#define REG_B__C_RST 0       // Bレジスタ
#define REG_I__C_RST 0       // Input (現物はDIPスイッチであるため保持されているべき)
#define REG_O__C_RST 0       // Output
#define REG_PC_C_RST 0       // プログラムカウンタ
#define REG_SR_C_RST 0       // ステータスレジスタ

// レジスタ設定 : リセット端子によるリセット値 (WARM RESET)
#define REG_A__W_RST 0       // Aレジスタ
#define REG_B__W_RST 0       // Bレジスタ
#define REG_I__W_RST 0       // Input (現物はDIPスイッチであるため保持されているべき)
#define REG_O__W_RST 0       // Output
#define REG_PC_W_RST 0       // プログラムカウンタ
#define REG_SR_W_RST 0       // ステータスレジスタ

// レジスタ設定 : 最大値 / 有効ビット取得マスク
#define REG_A__MAX   0x0F    // Aレジスタ          : 4ビット幅 (1ニブル)
#define REG_B__MAX   0x0F    // Bレジスタ          : 4ビット幅 (1ニブル)
#define REG_I__MAX   0x0F    // Input              : 4ビット幅 (1ニブル)
#define REG_O__MAX   0x0F    // Output             : 4ビット幅 (1ニブル)
#define REG_PC_MAX   0x0F    // プログラムカウンタ : 4ビット幅 (1ニブル)
#define REG_SR_MAX   0x0F    // ステータスレジスタ : 4ビット幅 (1ニブル)

// レジスタ設定 : 有効ビット最上位番号
#define REG_A__BW    3       // Aレジスタ          : 4ビット幅 (bit:0～bit:3)
#define REG_B__BW    3       // Bレジスタ          : 4ビット幅 (bit:0～bit:3)
#define REG_I__BW    3       // Input              : 4ビット幅 (bit:0～bit:3)
#define REG_O__BW    3       // Output             : 4ビット幅 (bit:0～bit:3)
#define REG_PC_BW    3       // プログラムカウンタ : 4ビット幅 (bit:0～bit:3)
#define REG_SR_BW    3       // ステータスレジスタ : 4ビット幅 (bit:0～bit:3)

// レジスタ設定 : R/W属性
#define REG_A__RW    ATTR_RW // Aレジスタ
#define REG_B__RW    ATTR_RW // Bレジスタ
#define REG_I__RW    ATTR_R  // Input (現物の実装がDIPスイッチのため Read Onry)
#define REG_O__RW    ATTR_RW // Output
#define REG_PC_RW    ATTR_RW // プログラムカウンタ
#define REG_SR_RW    ATTR_RW // ステータスレジスタ

// レジスタ設定 : ステータスレジスタ(SR) 各フラグのビット位置
#define SR_BIT_C     0x01    // b0 C : キャリーフラグ
#define SR_BIT_1     0x02    // b1 未使用
#define SR_BIT_2     0x04    // b2 未使用
#define SR_BIT_3     0x08    // b3 未使用

//============================================================================================
// 型定義 (内部用)
//============================================================================================

//============================================================================================
// プロトタイプ宣言 (static)
//============================================================================================
// CPU命令
static U1 u1f_s_CpuInst_ADD_AI(U1 u1_operand); // $0 : ADD A,Im : AレジスタにImを加算
static U1 u1f_s_CpuInst_MOV_AB(U1 u1_operand); // $1 : MOV A,B  : AレジスタにBレジスタを転送
static U1 u1f_s_CpuInst_IN_A__(U1 u1_operand); // $2 : IN A     : 入力ポートからAレジスタへ転送
static U1 u1f_s_CpuInst_MOV_AI(U1 u1_operand); // $3 : MOV A,Im : AレジスタにImを転送
static U1 u1f_s_CpuInst_MOV_BA(U1 u1_operand); // $4 : MOV B,A  : BレジスタにAレジスタを転送
static U1 u1f_s_CpuInst_ADD_BI(U1 u1_operand); // $5 : ADD B,Im : BレジスタにImを加算
static U1 u1f_s_CpuInst_IN_B__(U1 u1_operand); // $6 : IN B     : 入力ポートからBレジスタへ転送
static U1 u1f_s_CpuInst_MOV_BI(U1 u1_operand); // $7 : MOV B,Im : BレジスタにImを転送
static U1 u1f_s_CpuInst_UD_H_8(U1 u1_operand); // $8 : 未定義$8 : OUT Bと同じ動作をする
static U1 u1f_s_CpuInst_OUT_B_(U1 u1_operand); // $9 : OUT B    : 出力ポートへBレジスタを転送
static U1 u1f_s_CpuInst_UD_H_A(U1 u1_operand); // $A : 未定義$A : OUT Imと同じ動作をする
static U1 u1f_s_CpuInst_OUT_I_(U1 u1_operand); // $B : OUT Im   : 出力ポートへImを転送
static U1 u1f_s_CpuInst_UD_H_C(U1 u1_operand); // $C : 未定義$C : JNC Imと同じ動作をする
static U1 u1f_s_CpuInst_UD_H_D(U1 u1_operand); // $D : 未定義$D : JMP Imと同じ動作をする
static U1 u1f_s_CpuInst_JNC_I_(U1 u1_operand); // $E : JNC Im   : C = 0 ならジャンプ
static U1 u1f_s_CpuInst_JMP_I_(U1 u1_operand); // $F : JMP Im   : 無条件ジャンプ

//============================================================================================
// グローバル変数定義 (外部公開)
//============================================================================================

//============================================================================================
// 静的変数定義 (static)
//============================================================================================
// CPUレジスタ定義 (A)
static stREG st_s_RegA =
{
    REG_A__C_RST,         // パワーオンリセット値
    REG_A__W_RST,         // 端子リセット値
    REG_A__C_RST,         // 現在の値 (初期値をパワーオンリセット値とする)
    REG_A__MAX,           // レジスタ最大値 / 有効ビット取得マスク
    REG_A__BW,            // 有効ビット最上位番号
    REG_A__RW             // R/W属性
};

// CPUレジスタ定義 (B)
static stREG st_s_RegB =
{
    REG_B__C_RST,         // パワーオンリセット値
    REG_B__W_RST,         // 端子リセット値
    REG_B__C_RST,         // 現在の値 (初期値をパワーオンリセット値とする)
    REG_B__MAX,           // レジスタ最大値 / 有効ビット取得マスク
    REG_B__BW,            // 有効ビット最上位番号
    REG_B__RW             // R/W属性
};

// CPUレジスタ定義 (Input : 入力DIPスイッチ)
static stREG st_s_RegI =
{
    REG_I__C_RST,         // パワーオンリセット値
    REG_I__W_RST,         // 端子リセット値
    REG_I__C_RST,         // 現在の値 (初期値をパワーオンリセット値とする)
    REG_I__MAX,           // レジスタ最大値 / 有効ビット取得マスク
    REG_I__BW,            // 有効ビット最上位番号
    REG_I__RW             // R/W属性
};

// CPUレジスタ定義 (Output : 出力端子)
static stREG st_s_RegO =
{
    REG_O__C_RST,         // パワーオンリセット値
    REG_O__W_RST,         // 端子リセット値
    REG_O__C_RST,         // 現在の値 (初期値をパワーオンリセット値とする)
    REG_O__MAX,           // レジスタ最大値 / 有効ビット取得マスク
    REG_O__BW,            // 有効ビット最上位番号
    REG_O__RW             // R/W属性
};

// CPUレジスタ定義 (PC : プログラムカウンタ)
static stREG st_s_RegPC =
{
    REG_PC_C_RST,         // パワーオンリセット値
    REG_PC_W_RST,         // 端子リセット値
    REG_PC_C_RST,         // 現在の値 (初期値をパワーオンリセット値とする)
    REG_PC_MAX,           // レジスタ最大値 / 有効ビット取得マスク
    REG_PC_BW,            // 有効ビット最上位番号
    REG_PC_RW             // R/W属性
};

// CPUレジスタ定義 (SR : ステータスレジスタ)
static stREG st_s_RegSR =
{
    REG_SR_C_RST,         // パワーオンリセット値
    REG_SR_W_RST,         // 端子リセット値
    REG_SR_C_RST,         // 現在の値 (初期値をパワーオンリセット値とする)
    REG_SR_MAX,           // レジスタ最大値 / 有効ビット取得マスク
    REG_SR_BW,            // 有効ビット最上位番号
    REG_SR_RW             // R/W属性
};

// CPUレジスタテーブル (レジスタを番号で指定できるようにする)
static stREG* const stpca_s_RegTbl[CPU_REG_MAX] =
{
    &st_s_RegA,           // 0 : Aレジスタ
    &st_s_RegB,           // 1 : レジスタ
    &st_s_RegI,           // 2 : Input
    &st_s_RegO,           // 3 : Output
    &st_s_RegPC,          // 4 : プログラムカウンタ
    &st_s_RegSR,          // 5 : ステータスレジスタ
};

// CPU命令関数テーブル
static U1 (*const u1fpac_s_InstFuncTbl[CPU_INS_MAX])(U1 u1_operand) =
{
    u1f_s_CpuInst_ADD_AI, // $0 - ADD A,Im (Imが0の場合はNOPとなる)
    u1f_s_CpuInst_MOV_AB, // $1 - MOV A,B
    u1f_s_CpuInst_IN_A__, // $2 - IN  A
    u1f_s_CpuInst_MOV_AI, // $3 - MOV A,Im
    u1f_s_CpuInst_MOV_BA, // $4 - MOV B,A
    u1f_s_CpuInst_ADD_BI, // $5 - ADD B,Im
    u1f_s_CpuInst_IN_B__, // $6 - IN  B
    u1f_s_CpuInst_MOV_BI, // $7 - MOV B,Im
    u1f_s_CpuInst_UD_H_8, // $8 - 未定義命令 (OUT B と同じ動作をする)
    u1f_s_CpuInst_OUT_B_, // $9 - OUT B
    u1f_s_CpuInst_UD_H_A, // $A - 未定義命令 (OUT Im と同じ動作をする)
    u1f_s_CpuInst_OUT_I_, // $B - OUT Im
    u1f_s_CpuInst_UD_H_C, // $C - 未定義命令 (JNC Im と同じ動作をする)
    u1f_s_CpuInst_UD_H_D, // $D - 未定義命令 (JMC Im と同じ動作をする)
    u1f_s_CpuInst_JNC_I_, // $E - JNC Im
    u1f_s_CpuInst_JMP_I_, // $F - JMP Im
};

//============================================================================================
// 関数定義
//============================================================================================
//============================================================================================
// [デバッグ機能] プログラムカウンタを1つ進める
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 本来のCPU動作とは異なるデバッグ用機能
//============================================================================================
VD vdf_g_CpuDebugIncPc(VD)

{
    st_s_RegPC.u4_val ++;                             // プログラムカウンタ加算
    st_s_RegPC.u4_val &= st_s_RegPC.u4_max;           // 有効ビットをマスク
}

//============================================================================================
// [デバッグ機能] プログラムカウンタを1つ戻す
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 本来のCPU動作とは異なるデバッグ用機能
//============================================================================================
VD vdf_g_CpuDebugDecPc(VD)
{
    st_s_RegPC.u4_val --;                             // プログラムカウンタ減算
    st_s_RegPC.u4_val &= st_s_RegPC.u4_max;           // 有効ビットをマスク
}

//============================================================================================
// [デバッグ機能] プログラムカウンタの値を取得する
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : U4 u4_ret : (O) プログラムカウンタの値
//--------------------------------------------------------------------------------------------
// Note      :
// 本来のCPU動作とは異なるデバッグ用機能
//============================================================================================
U4 u4f_g_CpuDebugGetPc(VD)
{
    U4 u4_ret = stpca_s_RegTbl[CPU_REG_PC]->u4_val;   // プログラムカウンタの値を取得

    u4_ret &= stpca_s_RegTbl[CPU_REG_PC]->u4_max;     // 上限値でマスク

    return u4_ret;
}

//============================================================================================
// [デバッグ機能] レジスタ最上位有効ビット番号を取得
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_reg : (I) 対象レジスタ番号
// Return    : U1 u1_ret : (O) 対象レジスタの最上位ビット番号
//--------------------------------------------------------------------------------------------
// Note      :
// 本来のCPU動作とは異なるデバッグ用機能
//============================================================================================
U1 u1f_g_CpuDebugGetRegBitTop(U1 u1_reg)
{
    U1 u1_ret = 0;                                    // 失敗時は0が読み出される

    if(u1_reg < CPU_REG_MAX)                          // 有効なレジスタ番号であること
    {
        u1_ret = stpca_s_RegTbl[u1_reg]->u1_bit_top;  // 最上位ビット番号を取得
    }

    return u1_ret;
}

//============================================================================================
// [デバッグ機能] レジスタ直接 Read
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_reg : (I) 対象レジスタ番号
// Return    : U4 u4_ret : (O) 対象レジスタの値 (失敗時は0が読み出される)
//--------------------------------------------------------------------------------------------
// Note      :
// 本来のCPU動作とは異なるデバッグ用機能
//============================================================================================
U4 u4f_g_CpuDebugReadReg(U1 u1_reg)
{
    U4 u4_ret = 0;                                    // 失敗時は0が読み出される

    if(u1_reg < CPU_REG_MAX)                          // 有効なレジスタ番号であること
    {
        if(stpca_s_RegTbl[u1_reg]->u1_rw == ATTR_R || // R属性  または
           stpca_s_RegTbl[u1_reg]->u1_rw == ATTR_RW)  // RW属性 であること
        {
            u4_ret = (U1)(stpca_s_RegTbl[u1_reg]->u4_val & stpca_s_RegTbl[u1_reg]->u4_max);
        }
    }

    return u4_ret;
}

//============================================================================================
// [デバッグ機能] レジスタ直接 Write
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_reg : (I) 対象レジスタ番号
//             U4 u4_val : (I) 対象レジスタに書き込む値
// Return    : BL bl_ret : (O) TRUE  : 成功
//                             FALSE : 失敗
//--------------------------------------------------------------------------------------------
// Note      :
// 本来のCPU動作とは異なるデバッグ用機能
//============================================================================================
BL blf_g_CpuDebugWriteReg(U1 u1_reg, U4 u4_val)
{
    BL bl_ret = FALSE;

    if(u1_reg < CPU_REG_MAX)                          // 有効なレジスタ番号であること
    {
        if(stpca_s_RegTbl[u1_reg]->u1_rw == ATTR_W || // W属性  または
           stpca_s_RegTbl[u1_reg]->u1_rw == ATTR_RW)  // RW属性 であること
        {
            u4_val &= stpca_s_RegTbl[u1_reg]->u4_max;
            stpca_s_RegTbl[u1_reg]->u4_val = u4_val;
            bl_ret = TRUE;
        }
    }

    return bl_ret;
}

//============================================================================================
// 入力ポート(Inputレジスタ : DIPスイッチ)に値を設定する
//--------------------------------------------------------------------------------------------
// Arguments : U4 u4_val : (I) 入力ポート(Inputレジスタ)設定値
// Return    : -
//============================================================================================
VD vdf_g_CpuSetInput(U4 u4_val)
{
    u4_val &= stpca_s_RegTbl[CPU_REG_I]->u4_max;      // 引数を上限値でマスク
    stpca_s_RegTbl[CPU_REG_I]->u4_val = u4_val;       // 入力ポートに値を設定
}

//============================================================================================
// 出力ポート(Ouptutレジスタ)の値を取得する
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : U4 u4_ret : (O) 出力ポート(Outputレジスタ)の値
//============================================================================================
U4 u4f_g_CpuGetOutput(VD)
{
    U4 u4_ret = stpca_s_RegTbl[CPU_REG_O]->u4_val;    // 出力ポートの値を取得

    u4_ret &= stpca_s_RegTbl[CPU_REG_O]->u4_max;      // 上限値でマスク

    return u4_ret;
}

//============================================================================================
// CPUをリセット
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_rst_type : (I) 0 : RST_TYPE_COLD パワーオンリセット
//                                  1 : RST_TYPE_WARM 端子リセット
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 将来的なリセット要因追加を考慮してBL型ではなくU1型で定義。
// 分岐処理も単にelseとせず、あえて厳密にリセット要因毎に記述。
//============================================================================================
VD vdf_g_CpuReset(U1 u1_rst_type)
{
    U4 u4_i;

    // 全てのレジスタをリセット要因に応じた値に設定する
    for(u4_i = 0; u4_i < CPU_REG_MAX; u4_i ++)
    {
        if(u1_rst_type == RST_TYPE_COLD)              // パワーオンリセット
        {
            stpca_s_RegTbl[u4_i]->u4_val = stpca_s_RegTbl[u4_i]->u4c_cold_rst_val;
        }
        else if(u1_rst_type == RST_TYPE_WARM)         // 端子リセット
        {
            stpca_s_RegTbl[u4_i]->u4_val = stpca_s_RegTbl[u4_i]->u4c_warm_rst_val;
        }
    }
}

//============================================================================================
// CPUを1クロック実行
//--------------------------------------------------------------------------------------------
// Arguments : U1* u1p_rom : (I) プログラム保持領域のポインタ
// Return    : U1  u1_ret  : (O) CPU_RET_UINS  : 未定義命令
//                               CPU_RET_NJMP   : ジャンプ命令
//                               CPU_RET_NORM : 通常命令
//============================================================================================
U1 u1f_g_CpuExe1Clk(U1* u1p_rom)
{
    U1 u1_ret = CPU_RET_UINS;                         // 未定義命令
    U1 u1_opcode =
    (u1p_rom[st_s_RegPC.u4_val] & 0xF0) >> 4;         // 上位ニブル (命令)
    U1 u1_operand =
    u1p_rom[st_s_RegPC.u4_val] & 0x0F;                // 下位ニブル (パラメータ)

    u1_ret =
    (*u1fpac_s_InstFuncTbl[u1_opcode])(u1_operand);   // CPU命令を実行

    if(!(u1_ret & CPU_RET_B_JUMP))                    // ジャンプ命令ではない場合は
    {
        st_s_RegPC.u4_val ++;                         // プログラムカウンタを進める
        st_s_RegPC.u4_val &= st_s_RegPC.u4_max;       // 有効ビットをマスク
    }

    return u1_ret;
}

//============================================================================================
// ADD A,Im
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_ADD_AI(U1 u1_operand)
{
    st_s_RegA.u4_val &= st_s_RegA.u4_max;             // 有効ビットをマスク
    st_s_RegA.u4_val += u1_operand;                   // A += Im

    if(st_s_RegA.u4_val > st_s_RegA.u4_max)           // レジスタ最大値を超えた場合
    {
        st_s_RegA.u4_val  &= st_s_RegA.u4_max;        // 有効ビットをマスク
        st_s_RegSR.u4_val |= SR_BIT_C;                // Cフラグを立てる
    }
    else                                              // レジスタ最大値を超えない場合
    {
        st_s_RegSR.u4_val &= (~SR_BIT_C);             // Cフラグをクリア
    }

    return CPU_RET_NORM;                              // 通常命令
}

//============================================================================================
// MOV A,B
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//--------------------------------------------------------------------------------------------
// Note      :
// 本来、この命令はImが必ず0である仕様となっている。
// A ← B
// アセンブラ記述の場合は不正なImが混入することはないが、マシン語記述の場合この限りではない。
// 実機動作においてImが0以外の場合、以下の挙動となった。
// A ← B + Im (桁あふれ時はCフラグが立つ)
// 本エミュレータでは、この不正Im動作を含めて再現するものとする。
//============================================================================================
static U1 u1f_s_CpuInst_MOV_AB(U1 u1_operand)
{
    S1 s1_ret = CPU_RET_NORM;                         // 通常命令

    if(u1_operand) s1_ret = CPU_RET_UIMM;             // 不正Im命令 (本来Imは0であるべき)

    st_s_RegA.u4_val = st_s_RegB.u4_val + u1_operand; // A ← B + Im

    if(st_s_RegA.u4_val > st_s_RegA.u4_max)           // レジスタ最大値を超えた場合
    {
        st_s_RegA.u4_val  &= st_s_RegA.u4_max;        // 有効ビットをマスク
        st_s_RegSR.u4_val |= SR_BIT_C;                // Cフラグを立てる
    }
    else                                              // レジスタ最大値を超えない場合
    {
        st_s_RegSR.u4_val &= (~SR_BIT_C);             // Cフラグをクリア
    }

    return s1_ret; 
}

//============================================================================================
// IN A
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//--------------------------------------------------------------------------------------------
// Note      :
// 本来、この命令はImが必ず0である仕様となっている。
// A ← IN
// アセンブラ記述の場合は不正なImが混入することはないが、マシン語記述の場合この限りではない。
// 実機動作においてImが0以外の場合、以下の挙動となった。
// A ← IN + Im (桁あふれ時はCフラグが立つ)
// 本エミュレータでは、この不正Im動作を含めて再現するものとする。
//============================================================================================
static U1 u1f_s_CpuInst_IN_A__(U1 u1_operand)
{
    S1 s1_ret = CPU_RET_NORM;                         // 通常命令

    if(u1_operand) s1_ret = CPU_RET_UIMM;             // 不正Im命令 (本来Imは0であるべき)

    st_s_RegA.u4_val = st_s_RegI.u4_val + u1_operand; // A ← IN + Im

    if(st_s_RegA.u4_val > st_s_RegA.u4_max)           // レジスタ最大値を超えた場合
    {
        st_s_RegA.u4_val  &= st_s_RegA.u4_max;        // 有効ビットをマスク
        st_s_RegSR.u4_val |= SR_BIT_C;                // Cフラグを立てる
    }
    else                                              // レジスタ最大値を超えない場合
    {
        st_s_RegSR.u4_val &= (~SR_BIT_C);             // Cフラグをクリア
    }

    return s1_ret; 
}

//============================================================================================
// MOV A,Im
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_MOV_AI(U1 u1_operand)
{
    st_s_RegA.u4_val  =  u1_operand;                  // A ← Im
    st_s_RegSR.u4_val &= (~SR_BIT_C);                 // Cフラグをクリア
 
    return CPU_RET_NORM;                              // 通常命令
}

//============================================================================================
// MOV B,A
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//--------------------------------------------------------------------------------------------
// Note      :
// 本来、この命令はImが必ず0である仕様となっている。
// B ← A
// アセンブラ記述の場合は不正なImが混入することはないが、マシン語記述の場合この限りではない。
// 実機動作においてImが0以外の場合、以下の挙動となった。
// B ← A + Im (桁あふれ時はCフラグが立つ)
// 本エミュレータでは、この不正Im動作を含めて再現するものとする。
//============================================================================================
static U1 u1f_s_CpuInst_MOV_BA(U1 u1_operand)
{
    S1 s1_ret = CPU_RET_NORM;                         // 通常命令

    if(u1_operand) s1_ret = CPU_RET_UIMM;             // 不正Im命令 (本来Imは0であるべき)

    st_s_RegB.u4_val = st_s_RegA.u4_val + u1_operand; // B ← A + Im

    if(st_s_RegB.u4_val > st_s_RegB.u4_max)           // レジスタ最大値を超えた場合
    {
        st_s_RegB.u4_val  &= st_s_RegB.u4_max;        // 有効ビットをマスク
        st_s_RegSR.u4_val |= SR_BIT_C;                // Cフラグを立てる
    }
    else                                              // レジスタ最大値を超えない場合
    {
        st_s_RegSR.u4_val &= (~SR_BIT_C);             // Cフラグをクリア
    }

    return s1_ret; 
}

//============================================================================================
// ADD B,Im
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_ADD_BI(U1 u1_operand)
{
    st_s_RegB.u4_val &= st_s_RegB.u4_max;             // 有効ビットをマスク
    st_s_RegB.u4_val += u1_operand;                   // B += Im

    if(st_s_RegB.u4_val > st_s_RegB.u4_max)           // レジスタ最大値を超えた場合
    {
        st_s_RegB.u4_val &= st_s_RegB.u4_max;         // 有効ビットをマスク
        st_s_RegSR.u4_val |= SR_BIT_C;                // Cフラグを立てる
    }
    else                                              // レジスタ最大値を超えない場合 
    {
        st_s_RegSR.u4_val &= (~SR_BIT_C);             // Cフラグをクリア
    }
 
    return CPU_RET_NORM;                              // 通常命令
}

//============================================================================================
// IN B
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//--------------------------------------------------------------------------------------------
// Note      :
// 本来、この命令はImが必ず0である仕様となっている。
// B ← IN
// アセンブラ記述の場合は不正なImが混入することはないが、マシン語記述の場合この限りではない。
// 実機動作においてImが0以外の場合、以下の挙動となった。
// B ← IN + Im (桁あふれ時はCフラグが立つ)
// 本エミュレータでは、この不正Im動作を含めて再現するものとする。
//============================================================================================
static U1 u1f_s_CpuInst_IN_B__(U1 u1_operand)
{
    S1 s1_ret = CPU_RET_NORM;                         // 通常命令

    if(u1_operand) s1_ret = CPU_RET_UIMM;             // 不正Im命令 (本来Imは0であるべき)

    st_s_RegB.u4_val = st_s_RegI.u4_val + u1_operand; // B ← IN + Im

    if(st_s_RegB.u4_val > st_s_RegB.u4_max)           // レジスタ最大値を超えた場合
    {
        st_s_RegB.u4_val  &= st_s_RegB.u4_max;        // 有効ビットをマスク
        st_s_RegSR.u4_val |= SR_BIT_C;                // Cフラグを立てる
    }
    else                                              // レジスタ最大値を超えない場合
    {
        st_s_RegSR.u4_val &= (~SR_BIT_C);             // Cフラグをクリア
    }

    return s1_ret; 
}

//============================================================================================
// MOV B,Im
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_MOV_BI(U1 u1_operand)
{
    st_s_RegB.u4_val  =  u1_operand;                  // B ← Im
    st_s_RegSR.u4_val &= (~SR_BIT_C);                 // Cフラグをクリア
 
    return CPU_RET_NORM;                              // 通常命令
}

//============================================================================================
// 未定義命令 $8
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_UD_H_8(U1 u1_operand)
{
    u1f_s_CpuInst_OUT_B_(u1_operand);                 // OUT Bと同じ動作をする

    return CPU_RET_UINS;
}

//============================================================================================
// OUT B
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//--------------------------------------------------------------------------------------------
// Note      :
// 本来、この命令はImが必ず0である仕様となっている。
// OUT ← B
// アセンブラ記述の場合は不正なImが混入することはないが、マシン語記述の場合この限りではない。
// 実機動作においてImが0以外の場合、以下の挙動となった。
// OUT ← B + Im (桁あふれ時はCフラグが立つ)
// 本エミュレータでは、この不正Im動作を含めて再現するものとする。
//============================================================================================
static U1 u1f_s_CpuInst_OUT_B_(U1 u1_operand)
{
    S1 s1_ret = CPU_RET_NORM;                         // 通常命令

    if(u1_operand) s1_ret = CPU_RET_UIMM;             // 不正Im命令 (本来Imは0であるべき)

    st_s_RegO.u4_val = st_s_RegB.u4_val + u1_operand; // OUT ← B + Im

    if(st_s_RegO.u4_val > st_s_RegO.u4_max)           // レジスタ最大値を超えた場合
    {
        st_s_RegO.u4_val  &= st_s_RegO.u4_max;        // 有効ビットをマスク
        st_s_RegSR.u4_val |= SR_BIT_C;                // Cフラグを立てる
    }
    else                                              // レジスタ最大値を超えない場合
    {
        st_s_RegSR.u4_val &= (~SR_BIT_C);             // Cフラグをクリア
    }

    return s1_ret; 
}

//============================================================================================
// 未定義命令 $A
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_UD_H_A(U1 u1_operand)
{
    u1f_s_CpuInst_OUT_I_(u1_operand);                 // OUT Imと同じ動作をする

    return CPU_RET_UINS;                              // 未定義命令
}

//============================================================================================
// OUT Im
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_OUT_I_(U1 u1_operand)
{
    st_s_RegO.u4_val  =  u1_operand;                  // OUT ← Im
    st_s_RegSR.u4_val &= (~SR_BIT_C);                 // Cフラグをクリア
 
    return CPU_RET_NORM;                              // 通常命令
}

//============================================================================================
// 未定義命令 $C
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_UD_H_C(U1 u1_operand)
{
    u1f_s_CpuInst_JNC_I_(u1_operand);                 // JNC Imと同じ動作をする

    return CPU_RET_UJMP;                              // 未定義ジャンプ命令
}

//============================================================================================
// 未定義命令 $D
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_UD_H_D(U1 u1_operand)
{
    u1f_s_CpuInst_JMP_I_(u1_operand);                 // JMP Imと同じ動作をする

    return CPU_RET_UJMP;                              // 未定義ジャンプ命令
}

//============================================================================================
// JNC Im
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_JNC_I_(U1 u1_operand)
{
    if(st_s_RegSR.u4_val & SR_BIT_C)                  // Cフラグが1の場合
    {
        st_s_RegPC.u4_val ++;                         // ジャンプせずにPCを1つ進める
    }
    else                                              // Cフラグが0の場合
    {
        st_s_RegPC.u4_val = u1_operand;               // PC ← Im
    }

    st_s_RegSR.u4_val &= (~SR_BIT_C);                 // Cフラグをクリア
 
    return CPU_RET_NJMP;                              // ジャンプ命令
}

//============================================================================================
// JMP Im
//--------------------------------------------------------------------------------------------
// Arguments : U1 u1_operand : (I) オペランド  (命令に与えるパラメータ)
// Return    : U1            : (O) CPU命令属性 (cpu.hにて定義するマクロ定数)
//============================================================================================
static U1 u1f_s_CpuInst_JMP_I_(U1 u1_operand)
{
    st_s_RegPC.u4_val =  u1_operand;                  // PC ← Im
    st_s_RegSR.u4_val &= (~SR_BIT_C);                 // Cフラグをクリア
 
    return CPU_RET_NJMP;                              // ジャンプ命令
}
