//============================================================================================
// Application : TD4 Emulator & Assembler for X68000 - TD4.x
// Platform    : SHARP X68000 / Human68k
// Build       : GCC真里子版(ver1.42) + XCライブラリ
//--------------------------------------------------------------------------------------------
// Filename    : dbg_his.c
// Version     : 1.0.0
// Author      : SEN::DAC
// Description : デバッガモジュール (コマンド入力のヒストリ機能)
//============================================================================================
//============================================================================================
// インクルードファイル
//============================================================================================
#include "dbg_his.h"

//============================================================================================
// 定数定義 (内部用)
//============================================================================================
#define HIS_BUF_MAX 16                    // ヒストリのバッファ数

//============================================================================================
// 型定義 (内部用)
//============================================================================================
typedef struct
{
    U1 u1a_buf[HIS_BUF_MAX][CMD_BUF_MAX]; // (保持) ヒストリバッファ
    S1 s1_max;                            // (保持) バッファ使用数
    S1 s1_cnt;                            // (保持) バッファ書き込み位置
    S1 s1_sel;                            // (一時) インデックス(選択用)
    BL bl_state;                          // (一時) 選択状態フラグ   
}
stHISTORY;

//============================================================================================
// プロトタイプ宣言 (static)
//============================================================================================

//============================================================================================
// グローバル変数定義 (外部公開)
//============================================================================================

//============================================================================================
// 静的変数定義 (static)
//============================================================================================
static stHISTORY st_s_His = { 0 };

//============================================================================================
// 関数定義
//============================================================================================
//============================================================================================
// 一時変数の初期化
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//--------------------------------------------------------------------------------------------
// Note      :
// 毎ループ先頭(キー入力前)に呼び出すこと
//============================================================================================
VD vdf_g_HisBegin(VD)
{
    st_s_His.s1_sel   = st_s_His.s1_cnt;
    st_s_His.bl_state = FALSE;
}

//============================================================================================
// ヒストリ状態を無効にする
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : -
//============================================================================================
VD vdf_g_HisDisable(VD)
{
    st_s_His.bl_state = FALSE;
}

//============================================================================================
// ヒストリ状態を取得する
//--------------------------------------------------------------------------------------------
// Arguments : -
// Return    : BL st_s_His.bl_state : (O) TRUE  : ヒストリ状態である
//                                        FALSE : ヒストリ状態ではない 
//============================================================================================
BL blf_g_HisGetState(VD)
{
    return st_s_His.bl_state;
}

//============================================================================================
// ↑キーが押された場合の処理
//--------------------------------------------------------------------------------------------
// Arguments : U1* u1p_dst : (O) 文字列の出力先バッファ (コマンド入力欄に未確定状態で表示)
//             U1* u1p_len : (O) ヒストリ文字列長 (コマンド入力欄の現在カーソル位置となる)
// Return    : -
//============================================================================================
VD vdf_g_HisKeyUp(U1* u1p_dst, U1* u1p_len)
{
    st_s_His.s1_sel --;                                      // ひとつ前のヒストリ(最新)へ
    if(st_s_His.s1_sel < 0)
    {
        st_s_His.s1_sel = st_s_His.s1_max - 1;               // 0以下になったら現在の末尾に移動
    }
    if(st_s_His.s1_sel < 0) st_s_His.s1_sel = 0;             // それでも0以下になるなら0とする

    printf(st_s_His.u1a_buf[st_s_His.s1_sel]);               // ヒストリ文字列を表示
    strcpy(u1p_dst, st_s_His.u1a_buf[st_s_His.s1_sel]);      // ヒストリを適用
    *u1p_len = strlen(st_s_His.u1a_buf[st_s_His.s1_sel]);    // ヒストリの文字数を適用
    st_s_His.bl_state = TRUE;                                // ヒストリ状態にする
}

//============================================================================================
// ↓キーが押された場合の処理
//--------------------------------------------------------------------------------------------
// Arguments : U1* u1p_dst : (O) 文字列の出力先バッファ (コマンド入力欄に未確定状態で表示)
//             U1* u1p_len : (O) ヒストリ文字列長 (コマンド入力欄の現在カーソル位置となる)
// Return    : -
//============================================================================================
VD vdf_g_HisKeyDown(U1* u1p_dst, U1* u1p_len)
{
    if(!blf_g_HisGetState())                                 // ヒストリ状態ではない
    {
        if(st_s_His.s1_max != HIS_BUF_MAX)                   // バッファが埋まっていない (初周)
        {
            st_s_His.s1_sel = 0;                             // その場合は最古が必ず0番
        }                                                    // 埋まっている場合そのままで最古
    }
    else                                                     // 既にヒストリ状態である
    {
        st_s_His.s1_sel ++;                                  // ひとつ次のヒストリへ
        if(st_s_His.s1_sel >= st_s_His.s1_max)               // バッファ使用数を超えたら
        {
            st_s_His.s1_sel = 0;                             // バッファ先頭に戻す
        }
    }

    printf(st_s_His.u1a_buf[st_s_His.s1_sel]);               // ヒストリ文字列を表示
    strcpy(u1p_dst, st_s_His.u1a_buf[st_s_His.s1_sel]);      // ヒストリを適用
    *u1p_len = strlen(st_s_His.u1a_buf[st_s_His.s1_sel]);    // ヒストリの文字数を適用
    st_s_His.bl_state = TRUE;                                // ヒストリ状態にする
}

//============================================================================================
// ヒストリへの書き込み
//--------------------------------------------------------------------------------------------
// Arguments : U1* u1p_src : (I) ヒストリに書き込む文字列
// Return    : BL bl_ret   : (O) TRUE  : 書込みを行った
//                               FALSE : 書込みを行っていない (条件を満たしていない)
//============================================================================================
BL blf_g_HisWrite(U1* u1p_src)
{
    S4 s4_i;
    BL bl_ret = FALSE;                                       // 戻り値格納用

    // ヒストリからの入力ではない && 0～1文字ではない
    if(!blf_g_HisGetState() && u1p_src[0] != '\0' && u1p_src[1] != '\0')
    {
        for(s4_i = 0; s4_i < st_s_His.s1_max; s4_i++)        // 重複が無いか？
        {
            if(strcmp(st_s_His.u1a_buf[s4_i], u1p_src) == 0) // 有る場合は無効
            break;
        }

        if(s4_i >= st_s_His.s1_max)                          // 無い場合はヒストリに書き込む
        {
            strcpy(st_s_His.u1a_buf[st_s_His.s1_cnt], u1p_src);

            st_s_His.s1_cnt ++;                              // ヒストリ書き込み先 ++
            if(st_s_His.s1_cnt >= HIS_BUF_MAX)
            {
                st_s_His.s1_cnt = 0;                         // 最大数を超えたら戻す
            }

            st_s_His.s1_max ++;                              // バッファ使用数 ++
            if(st_s_His.s1_max >= HIS_BUF_MAX)
            {
                st_s_His.s1_max = HIS_BUF_MAX;               // 上限に達したら固定
            }

            bl_ret = TRUE;                                   // 書込みを行った通知
        }
    }

    return bl_ret;
}
